---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.SillHeight
source: html/812faa45-0613-5e51-2f87-b6b569c79485.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.SillHeight Property

Used for the conceptual energy model.
 The height from the nearest lower level used for auto-glazing created
 on walls.

## Syntax (C#)
```csharp
public double SillHeight { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The sill height is less than zero.